Revit 2027 API
Edge.GetCurveUV(Int32) Method
Calculate a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces. The output curve's direction will follow the parametric direction of the edge, not the topological direction of the edge on the given face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveUV GetCurveUV(
	int index
)
Public Function GetCurveUV (
	index As Integer
) As CurveUV
public:
CurveUV^ GetCurveUV(
	int index
)
member GetCurveUV :
        index : int -> CurveUV
Parameters
index Int32
The index of the face (0 or 1).
Return Value
CurveUV
If successful, returns the calculated CurveUV, null otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the specified index is not 0 or 1.
See Also
Reference
Edge Class
GetCurveUV Overload
Autodesk.Revit.DB Namespace